---
kind: type
id: T:Autodesk.Revit.DB.SpatialElementCalculationPoint
source: html/01206063-c774-da20-48ef-2cabf599e106.htm
---
# Autodesk.Revit.DB.SpatialElementCalculationPoint

SpatialElementCalculationPoint is used as the search point for family instances
 placement inside rooms and spaces.

## Syntax (C#)
```csharp
public class SpatialElementCalculationPoint : SpatialElementCalculationLocation
```

## Remarks
The Spatial Element Calculation Point is graphically showed as a location point
 marker with a "snake" line from the origin of the family. If the
 Spatial Element Calculation Point is turned on, this point will be used as a
 search point for room and space relations for all instances of this family.